package data

type CategoryToDifficulty struct {
	Category string
	Difficulty string
}

var Categories = []string{
	"флора и фауна",
	"города и страны",
	"наука",
	"хобби",
	"поп-культура",
}

var Difficulties = []string{
	"easy",
	"medium",
	"hard",
}

var Words = map[CategoryToDifficulty][]string{
	{"флора и фауна", "easy"}: {"кот", "кит", "пёс", "лиса", "дуб", "ель", "рысь", "мак", "слон", "волк", "жаба", "клен", "тигр"},
	{"флора и фауна", "medium"}: {"верблюд", "акула", "орхидея", "сова","медуза", "муравей", "кенгуру", "карась", "гепард", "тунец"},
	{"флора и фауна", "hard"}: {"гиацинт", "гиппопотам", "хризантема", "шимпанзе", "страус", "альбатрос", "эвкалипт", "орангутан",
								"азалия", "сурикат", "ирбис"},
	{"города и страны", "easy"}: {"Москва", "Париж", "Рим", "Берлин", "Лондон", "Киев", "Прага", "Минск", "Токио", "Осло", "Россия", "США"},
	{"города и страны", "medium"}: {"Стамбул", "Варшава", "Афины", "Дели", "Хельсинки", "Сеул", "Вена", "Торонто", "Пекин", "София", "Каир"},
	{"города и страны", "hard"}: {"Лихтенштейн", "Братислава", "Копенгаген", "Буэнос-Айрес", "Джакарта", "Йоханнесбург", "Монтевидео", "Манчестер",
								  "Лиссабон", "Владивосток", "Мельбурн"},
	{"наука", "easy"}: {"атом", "свет", "сила", "число", "звук", "вес", "ток", "клетка", "мозг", "вирус"},
	{"наука", "medium"}: {"формула", "энергия", "геном", "кислота", "элемент", "спектр", "орбита", "нейрон", "теория", "масса", "фермент"},
	{"наука", "hard"}: {"радиохимия", "астрофизика", "биоинформатика", "электродинамика", "генетика", "радиология", "экология", "космология",
					    "кибернетика", "биофизика", "эпидемиология"},
	{"хобби", "easy"}: {"шахматы", "бег", "рыбалка", "книги", "фото", "йога", "рисование", "танцы", "пение", "сад"},
	{"хобби", "medium"}: {"коллекции", "вязание", "кулинария", "скейтборд", "гитара", "туризм", "живопись", "каратэ", "плавание", "театр", "настолки"},
	{"хобби", "hard"}: {"оригами", "каллиграфия", "авиамоделизм", "программирование", "археология", "альпинизм", "реставрация", "филателия",
						"астрономия", "аквариумистика"},
	{"поп-культура", "easy"}: {"Бэтмен", "Шрек", "Флэш", "Гарри", "Йода", "Эльза", "Марио", "Соник", "Миньон", "Халк", "Фродо", "Тор", "Супермен"},
	{"поп-культура", "medium"}: {"Покемон", "Человек-паук", "Ведьмак", "Танос", "Локи", "Джокер", "Дракула", "Грут", "Чебурашка", "Железный человек"},
	{"поп-культура", "hard"}: {"Дарт Вейдер", "Доктор Стрэндж", "Саруман", "Годзилла", "Дабмлдор", "Джон Сноу", "Хитман", "Багз Банни", "Оптимус Прайм",
							   "Тирион Ланнистер", "Гэндальф", "Бамблби"},
}

var Stages = []string {
	`
       +---+
           |
           |
           |
           |
           |
    =========`,
	`
       +---+
       |   |
           |
           |
           |
           |
    =========`,
	`
       +---+
       |   |
       O   |
           |
           |
           |
	=========`,
	`
       +---+
       |   |
       O   |
       |   |
           |
           |
	=========`,
	`
       +---+
       |   |
       O   |
      /|   |
           |
           |
    =========`,
	`
       +---+
       |   |
       O   |
      /|\  |
           |
           |
    =========`,
	`
       +---+
       |   |
       O   |
      /|\  |
      /    |
           |
    =========`,
	`
       +---+
       |   |
       O   |
      /|\  |
      / \  |
           |
    =========`,
    `
       +---+
       |   |
      [O]  |
      /|\  |
      / \  |
           |
    =========`}
