package data

const MinCategoryNumber = 1
const MaxCategoryNumber = 5
const MinDifficulty = 1
const MaxDifficulty = 3
const AttemptsDefault = 8

type Difficulty int

const (
       Easy Difficulty = iota
	Medium
	Hard
       NotPicked
)

type Category int

const (
       FloraFauna Category = iota
       CitiesCountries
       Science
       Hobby
       PopCulture
)

func (diff Difficulty) DifficultyString() string {
	switch diff {
	case Easy:
	       return "easy"
	case Medium:
	       return "medium"
	case Hard:
	       return "hard"
	default:
	       return "unknown"
	}
}

func (cat Category) CategoryString() string {
       switch cat {
       case FloraFauna:
              return "флора и фауна"
       case CitiesCountries:
              return "города и страны"
       case Science:
              return "наука"
       case Hobby:
              return "хобби"
       case PopCulture:
              return "поп-культура"
       default:
              return "unknown"
       }
}

type CategoryToDifficulty struct {
	Category Category
	Difficulty Difficulty
}

var Words = map[CategoryToDifficulty][]string{
	{FloraFauna, Easy}: {"кот", "кит", "пёс", "лиса", "дуб", "ель", "рысь", "мак", "слон", "волк", "жаба", "клен", "тигр"},
	{FloraFauna, Medium}: {"верблюд", "акула", "орхидея", "сова","медуза", "муравей", "кенгуру", "карась", "гепард", "тунец"},
	{FloraFauna, Hard}: {"гиацинт", "гиппопотам", "хризантема", "шимпанзе", "страус", "альбатрос", "эвкалипт", "орангутан",
								"азалия", "сурикат", "ирбис"},
	{CitiesCountries, Easy}: {"Москва", "Париж", "Рим", "Берлин", "Лондон", "Киев", "Прага", "Минск", "Токио", "Осло", "Россия", "США"},
	{CitiesCountries, Medium}: {"Стамбул", "Варшава", "Афины", "Дели", "Хельсинки", "Сеул", "Вена", "Торонто", "Пекин", "София", "Каир"},
	{CitiesCountries, Hard}: {"Лихтенштейн", "Братислава", "Копенгаген", "Буэнос-Айрес", "Джакарта", "Йоханнесбург", "Монтевидео", "Манчестер",
								  "Лиссабон", "Владивосток", "Мельбурн"},
	{Science, Easy}: {"атом", "свет", "сила", "число", "звук", "вес", "ток", "клетка", "мозг", "вирус"},
	{Science, Medium}: {"формула", "энергия", "геном", "кислота", "элемент", "спектр", "орбита", "нейрон", "теория", "масса", "фермент"},
	{Science, Hard}: {"радиохимия", "астрофизика", "биоинформатика", "электродинамика", "генетика", "радиология", "экология", "космология",
					    "кибернетика", "биофизика", "эпидемиология"},
	{Hobby, Easy}: {"шахматы", "бег", "рыбалка", "книги", "фото", "йога", "рисование", "танцы", "пение", "сад"},
	{Hobby, Medium}: {"коллекции", "вязание", "кулинария", "скейтборд", "гитара", "туризм", "живопись", "каратэ", "плавание", "театр", "настолки"},
	{Hobby, Hard}: {"оригами", "каллиграфия", "авиамоделизм", "программирование", "археология", "альпинизм", "реставрация", "филателия",
						"астрономия", "аквариумистика"},
	{PopCulture, Easy}: {"Бэтмен", "Шрек", "Флэш", "Гарри", "Йода", "Эльза", "Марио", "Соник", "Миньон", "Халк", "Фродо", "Тор", "Супермен"},
	{PopCulture, Medium}: {"Покемон", "Человек-паук", "Ведьмак", "Танос", "Локи", "Джокер", "Дракула", "Грут", "Чебурашка", "Железный человек"},
	{PopCulture, Hard}: {"Дарт Вейдер", "Доктор Стрэндж", "Саруман", "Годзилла", "Дабмлдор", "Джон Сноу", "Хитман", "Багз Банни", "Оптимус Прайм",
							   "Тирион Ланнистер", "Гэндальф", "Бамблби"},
}

var Stages = []string {
	`
       +---+
           |
           |
           |
           |
           |
    =========`,
	`
       +---+
       |   |
           |
           |
           |
           |
    =========`,
	`
       +---+
       |   |
       O   |
           |
           |
           |
	=========`,
	`
       +---+
       |   |
       O   |
       |   |
           |
           |
	=========`,
	`
       +---+
       |   |
       O   |
      /|   |
           |
           |
    =========`,
	`
       +---+
       |   |
       O   |
      /|\  |
           |
           |
    =========`,
	`
       +---+
       |   |
       O   |
      /|\  |
      /    |
           |
    =========`,
	`
       +---+
       |   |
       O   |
      /|\  |
      / \  |
           |
    =========`,
    `
       +---+
       |   |
      [O]  |
      /|\  |
      / \  |
           |
    =========`}
